app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def find
    @movies_with_director = Movie.same_director(params[:title])
    if @movies_with_director.nil?
      redirect_to root_url, alert: "'#{params[:title]}' has no director info"
    end
    @movie = Movie.find_by(title: params[:title])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]